x = float(input('Введите Вашу выручку:\n'))
y = float(input('Введите Ваши издержки:\n'))

res = x - y
print(f'Ваш баланс:\n {res:.2f} руб.\n')

if res > 0 :
    print('Вы в плюсе!')
    r = x / y
    print(f'Рентабельность прибыли:\n {r:.2f}%\n')
    z = int(input('Введите количество сотрудников:\n'))
    p = res / z
    print(f'Прибыль на каждого сотрудника:\n {p:.2f} руб.\n')
    
elif res < 0 :
    print('Вы в убытке, увы..\n')
    
else :
    print('Главное: Вы не в минусе..\n')


input('Для выхода нажмите любую клавишу..')


