f = 0
while f == 0:
    n = input("Введите номер месяца\n")
    f = 1 if n.isdigit() == True and 0 < int(n) < 13 else 0

#словарь+список - самый предпочтительный вариант
l = {'Зима' : [1, 2, 12], \
     'Весна' : [3, 4, 5], \
     'Лето' : [6, 7, 8], \
     'Осень' : [9, 10 ,11]}

for k, v in l.items() :
    if int(n) in v : print(k)


#список    
l = [['Зима', 1, 2, 12],\
     ['Весна', 3, 4, 5],\
     ['Лето', 6, 7, 8],\
     ['Осень', 9, 10 ,11]]

x = 0
while x < len(l) :
    if int(n) in l[x][1:] :
        print(l[x][0])
        break
    x += 1


#словарь
l = {}
l['1'] = 'Зима'
l['2'] = 'Зима'
l['3'] = 'Весна'
l['4'] = 'Весна'
l['5'] = 'Весна'
l['6'] = 'Лето'
l['7'] = 'Лето'
l['8'] = 'Лето'
l['9'] = 'Осень'
l['10'] = 'Осень'
l['11'] = 'Осень'
l['12'] = 'Зима'
for k, v in l.items() :
    if n == k : print(v)
